#Напишите программу, которая считывает строку-разделитель и три строки,
# а затем выводит указанные строки через разделитель.

sep, a, b, c = input(), input(), input(), input()
print(
    a, b, c, sep=sep
)
