# Напишите программу, которая считывает три целых числа и выводит на экран их сумму.
# Каждое число записано в отдельной строке.

num1, num2, num3 = int(input()), int(input()), int(input())
print(
    num1 + num2 + num3
)