# Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.\

num = int(input())
print(
    'Объем =', num**3
)
print(
    'Площадь полной поверхности =', 6 * num ** 2
)