# Напишите программу, которая считает стоимость трех компьютеров,
# состоящих из монитора, системного блока, клавиатуры и мыши.

a, b, c, d = int(input()), int(input()), int(input()), int(input())
print(
    (a+b+c+d)*3
)