# Напишите программу, которая находит полное число метров по заданному числу сантиметров.

x = int(input())
print(
    x//100
)