# Дано трехзначное число abc,
# в котором все цифры различны. Напишите программу,
# которая выводит шесть чисел, образованных при перестановке цифр заданного числа.

x = int(input())
print(
    (x // 100), ((x % 100) // 10), (x % 10), sep=''
)
print(
    (x // 100), (x % 10), ((x % 100) // 10), sep=''
)
print(
    ((x % 100) // 10), (x // 100), (x % 10), sep=''
)
print(
    ((x % 100) // 10), (x % 10), (x // 100), sep=''
)
print(
    (x % 10), (x // 100), ((x % 100) // 10), sep=''
)
print(
    (x % 10), ((x % 100) // 10), (x // 100), sep=''
)